Repository: ebiggio/prestashop-customer-dni
Catalog: translations/*/ModulesCustomerdniAdmin.*.xlf
Languages: es_es

source: Customer DNI
es_es: RUT del cliente

source: Adds a custom DNI field to customer registration and personal information forms.
es_es: Añade un campo RUT a los formularios de registro de clientes e información personal.

source: The DNI is required.
es_es: El RUT es requerido.

source: The DNI is not valid.
es_es: El RUT no es válido.

source: The DNI is already assigned to another customer.
es_es: El RUT ya está asignado a otro cliente.

source: Customer DNI module settings
es_es: Configuración del módulo RUT del cliente

source: The regular expression is not valid.
es_es: La expresión regular no es válida.

source: The value is not valid.
es_es: El valor no es válido.

source: Display DNI field
es_es: Mostrar el RUT

source: If enabled, the DNI field will be displayed in the customer list of the back office.
es_es: Si está habilitado, el campo RUT se mostrará en el listado de clientes del back office.

source: Require DNI
es_es: Requerir RUT

source: If enabled, the DNI field will be a required field when creating or editing a customer.
es_es: Si está habilitado, el campo RUT será un campo obligatorio al crear o editar un cliente.

source: Unique DNI
es_es: RUT único

source: If enabled, the DNI field will be marked as unique, meaning that two customers cannot have the same DNI.
es_es: Si se habilita, el campo RUT se marcará como único, lo que significa que dos clientes no pueden tener el mismo RUT.

source: Overwrite address DNI
es_es: Sobrescribir RUT de la dirección

source: If enabled, the customer DNI will be copied to the address DNI field for each of the customer's addresses. Keep in mind that the address DNI field has a maximum length of 16 characters, so any value longer than that will be truncated.
es_es: Si se habilita, el RUT del cliente se copiará en el campo RUT de la dirección para cada una de las direcciones del cliente. Ten en cuenta que el campo RUT de la dirección tiene una longitud máxima de 16 caracteres, por lo que cualquier valor superior se truncará.

source: Regular expression to perform validation
es_es: Expresión regular para realizar validación

source: If not empty, the DNI field will be validated against this regular expression.
es_es: Si no está vacío, el campo RUT se validará contra esta expresión regular.

source: Use custom validators
es_es: Utilizar validadores personalizados

source: If enabled, additional validations will be performed on the DNI field, based on the PHP classes inside the "validations" folder. This is a feature intended to be used by developers; if you're not sure about the contents of the scripts inside the "validations" folder, please disable this option.
es_es: Si se habilita, se realizarán validaciones adicionales en el campo DNI, en función de las clases PHP dentro de la carpeta "validations". Esta es una función destinada a ser utilizada por desarrolladores; si no estás seguro acerca del contenido de los scripts dentro de la carpeta "validations", deshabilita esta opción.

source: The RUT is not valid.
es_es: El RUT no es válido.

source: The RUT has an invalid format.
es_es: El RUT tiene un formato inválido.

source: Module settings
es_es: Configuración del módulo
